Revit 2027 API
PowerFactorStateType Enumeration
 An enumerated type listing all the possible power factor state types for a connector object.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PowerFactorStateType
Public Enumeration PowerFactorStateType
public enum class PowerFactorStateType
type PowerFactorStateType
Members
Member name | Value | Description
Lagging | 1 |  Power FactorState Type is Lagging.
Leading | 0 |  Power FactorState Type is Leading.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace